#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.manage_roles will be created
  + resource "aws_iam_policy" "manage_roles" {
      + arn         = (known after apply)
      + description = "Policy that allows the creation of roles"
      + id          = (known after apply)
      + name        = "ManageRoles"
      + name_prefix = (known after apply)
      + path        = "/IacGhcPipelineResourceManagerPolicy/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PutRolePolicy",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::327110749334:role/IacGhcPipelineResourceManagerRoles/test_role"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Developer"      = "StratusGrid"
          + "Environment"    = "dev"
          + "Provisioner"    = "Terraform"
          + "Region_Purpose" = "Active"
          + "SourceRepo"     = "https://github.com/jasonlll88/test-account-starter-permissions"
          + "Terraform"      = "true"
        }
    }

  # aws_iam_role.test_role will be created
  + resource "aws_iam_role" "test_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role"
      + name_prefix           = (known after apply)
      + path                  = "/IacGhcPipelineResourceManagerRoles/"
      + tags_all              = {
          + "Developer"      = "StratusGrid"
          + "Environment"    = "dev"
          + "Provisioner"    = "Terraform"
          + "Region_Purpose" = "Active"
          + "SourceRepo"     = "https://github.com/jasonlll88/test-account-starter-permissions"
          + "Terraform"      = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.manage_roles will be created
  + resource "aws_iam_role_policy_attachment" "manage_roles" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "IacGhcPipelineResourceManagerRole"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
